Repository: oflorezawaken-dev/huawei-app-factory
Catalog: apps-ios/site-calc/Sources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, it, pt_pt, tr, zh_hans

# settings.statement.noRegulatoryValues
source: SiteCalc holds no regulatory limit of any kind. Your own limits are the only ones used.
ar: لا يحتوي SiteCalc على أي حد تنظيمي من أي نوع. تُستخدم حدودك أنت فقط.
de: SiteCalc enthält keinerlei behördlichen Grenzwert. Nur deine eigenen Grenzwerte werden verwendet.
es: SiteCalc no contiene ningún límite reglamentario. Solo se usan tus propios límites.
fr: SiteCalc ne contient aucune limite réglementaire. Seules vos propres limites sont utilisées.
it: SiteCalc non contiene alcun limite regolamentare. Vengono usati solo i tuoi limiti.
pt_pt: O SiteCalc não contém qualquer limite regulamentar. Só se usam os teus próprios limites.
tr: SiteCalc hiçbir türde resmi bir sınır değeri taşımaz. Yalnızca senin kendi sınırların kullanılır.
zh_hans: SiteCalc 不包含任何形式的法规限值，只使用你自己设定的限值。

# settings.studSpacing
source: Stud spacing
ar: تباعد القوائم
de: Ständerabstand
es: Separación de montantes
fr: Entraxe des montants
it: Interasse montanti
pt_pt: Espaçamento de montantes
tr: Dikme aralığı
zh_hans: 立柱间距

# settings.support
source: Support
ar: الدعم
es: Soporte
fr: Assistance
it: Assistenza
pt_pt: Suporte
tr: Destek
zh_hans: 支持

# settings.system
source: Unit system
ar: نظام الوحدات
de: Einheitensystem
es: Sistema de unidades
fr: Système d'unités
it: Sistema di unità
pt_pt: Sistema de unidades
tr: Birim sistemi
zh_hans: 单位制

# settings.system.imperial
source: Imperial
ar: إمبراطوري
fr: Impérial
it: Imperiale
tr: İngiliz birimleri
zh_hans: 英制

# settings.system.metric
source: Metric
ar: متري
de: Metrisch
es: Métrico
fr: Métrique
it: Metrico
pt_pt: Métrico
tr: Metrik
zh_hans: 公制

# settings.tileWaste
source: Tile waste
ar: هدر البلاط
de: Fliesenverschnitt
es: Merma de baldosa
fr: Chute de carrelage
it: Sfrido piastrelle
pt_pt: Desperdício de ladrilho
tr: Fayans fire payı
zh_hans: 瓷砖损耗

# solver.fromWhatYouEntered
source: From what you entered: %@
ar: بناءً على ما أدخلته: %@
de: Aus deinen Eingaben: %@
es: A partir de lo que introdujiste: %@
fr: D'après ce que vous avez saisi : %@
it: In base a quanto inserito: %@
pt_pt: A partir do que introduziste: %@
tr: Girdiğin değerlere göre: %@
zh_hans: 根据你输入的内容：%@

# solver.saveToJob
source: Save into a job
ar: الحفظ في مشروع
de: In einem Projekt speichern
es: Guardar en un proyecto
fr: Enregistrer dans un chantier
it: Salva in un cantiere
pt_pt: Guardar num projeto
tr: Bir işe kaydet
zh_hans: 保存到项目

# solver.sendToEstimator
source: Send to estimator
ar: إرسال إلى حاسبة المواد
de: An den Materialrechner senden
es: Enviar al estimador
fr: Envoyer vers l'estimation
it: Invia allo stimatore
pt_pt: Enviar para o estimador
tr: Hesaplayıcıya gönder
zh_hans: 发送到材料估算

# solver.sendToTape
source: Send to tape
ar: إرسال إلى الشريط
de: An das Band senden
es: Enviar a la cinta
fr: Envoyer au ruban
it: Invia al nastro
pt_pt: Enviar para a fita
tr: Şeride gönder
zh_hans: 发送到纸带

# solvers.areaVolume
source: Area and volume
ar: المساحة والحجم
de: Fläche und Volumen
es: Superficie y volumen
fr: Surface et volume
it: Area e volume
pt_pt: Área e volume
tr: Alan ve hacim
zh_hans: 面积与体积

# solvers.materials
source: Material estimator
ar: حاسبة المواد
de: Materialrechner
es: Estimador de materiales
fr: Estimation des matériaux
it: Stimatore materiali
pt_pt: Estimador de materiais
tr: Malzeme hesaplayıcı
zh_hans: 材料估算

# solvers.recent
source: Recently used
ar: المستخدَمة مؤخرًا
de: Zuletzt verwendet
es: Usados recientemente
fr: Récemment utilisés
it: Usati di recente
pt_pt: Usados recentemente
tr: Son kullanılanlar
zh_hans: 最近使用

# solvers.roof
source: Roof and right angle
ar: السقف والمثلث القائم
de: Dach und rechter Winkel
es: Cubierta y triángulo rectángulo
fr: Toiture et triangle rectangle
it: Tetto e triangolo rettangolo
pt_pt: Cobertura e triângulo retângulo
tr: Çatı ve dik üçgen
zh_hans: 屋面与直角三角形

# solvers.stair
source: Stair layout
ar: تخطيط السلالم
de: Treppenlayout
es: Trazado de escalera
fr: Tracé d'escalier
it: Tracciato scala
pt_pt: Traçado de escadas
tr: Merdiven düzeni
zh_hans: 楼梯布局

# stair.inputs
source: Your own limits
ar: حدودك الخاصة
de: Deine eigenen Grenzwerte
es: Tus propios límites
fr: Vos propres limites
it: I tuoi limiti
pt_pt: Os teus próprios limites
tr: Kendi sınırların
zh_hans: 你自己的限值

# stair.maxRiser
source: Maximum riser height
ar: أقصى ارتفاع للقائمة
de: Maximale Steigungshöhe
es: Contrahuella máxima
fr: Hauteur maximale de contremarche
it: Alzata massima
pt_pt: Espelho máximo
tr: Azami rıht yüksekliği
zh_hans: 最大踢面高度

# stair.minTread
source: Minimum tread depth
ar: أدنى عمق للدرجة
de: Minimale Auftrittstiefe
es: Huella mínima
fr: Giron minimal
it: Pedata minima
pt_pt: Cobertor mínimo
tr: Asgari basamak genişliği
zh_hans: 最小踏面深度

# stair.result
source: Result
ar: النتيجة
de: Ergebnis
es: Resultado
fr: Résultat
it: Risultato
pt_pt: Resultado
tr: Sonuç
zh_hans: 结果

# stair.riserCount
source: Riser count
ar: عدد القوائم
de: Anzahl der Steigungen
es: Número de contrahuellas
fr: Nombre de contremarches
it: Numero di alzate
pt_pt: Número de espelhos
tr: Rıht sayısı
zh_hans: 踢面数

# stair.riserHeight
source: Exact riser height
ar: الارتفاع الدقيق للقائمة
de: Exakte Steigungshöhe
es: Altura exacta de contrahuella
fr: Hauteur exacte de contremarche
it: Alzata esatta
pt_pt: Altura exata do espelho
tr: Tam rıht yüksekliği
zh_hans: 精确踢面高度

# stair.shortfallStatement
source: Building every riser at the nearest fraction would fall %@ short of the total rise.
ar: بناء كل قائمة عند أقرب كسر سيترك نقصًا مقداره %@ عن الارتفاع الكلي.
de: Jede Steigung auf die nächste Bruchzahl gebaut, fehlten am Ende %@ von der Gesamthöhe.
es: Construir cada contrahuella con la fracción más cercana quedaría %@ corto respecto a la altura total.
fr: Construire chaque contremarche à la fraction la plus proche laisserait un manque de %@ par rapport à la hauteur totale.
it: Costruire ogni alzata alla frazione più vicina lascerebbe uno scarto di %@ rispetto all'altezza totale.
pt_pt: Construir cada espelho na fração mais próxima ficaria %@ aquém da altura total.
tr: Her rıhtı en yakın kesre göre yapmak toplam yükseklikten %@ eksik bırakır.
zh_hans: 如果每级踢面都按最接近的分数建造，总升高将短少 %@。

# stair.solve
source: Solve
ar: حل
de: Lösen
es: Resolver
fr: Résoudre
it: Risolvi
pt_pt: Resolver
tr: Çöz
zh_hans: 求解

# stair.statement.yourLimits
source: Empty until you fill both in. SiteCalc ships no maximum riser or minimum tread of its own -- your own limits are the only current ones.
ar: يبقى فارغًا حتى تملأ كليهما. لا يحمل SiteCalc أي قائمة أو درجة خاصة به -- حدودك أنت هي الوحيدة الحالية.
de: Leer, bis du beide ausgefüllt hast. SiteCalc bringt keine eigene Steigung oder Auftrittstiefe mit -- nur deine eigenen Grenzwerte sind aktuell.
es: Vacío hasta que rellenes ambos. SiteCalc no trae contrahuella ni huella propias -- tus propios límites son los únicos vigentes.
fr: Vide tant que les deux ne sont pas remplis. SiteCalc n'embarque aucune contremarche ni giron -- vos propres limites sont les seules à jour.
it: Vuoto finché non compili entrambi. SiteCalc non porta alzata o pedata proprie -- i tuoi limiti sono gli unici aggiornati.
pt_pt: Vazio até preencheres os dois. O SiteCalc não traz espelho nem cobertor próprios -- os teus limites são os únicos atuais.
tr: İkisini de doldurana kadar boş kalır. SiteCalc kendine ait bir rıht veya basamak değeri taşımaz -- güncel olan yalnızca senin sınırlarındır.
zh_hans: 两项都填写之前保持空白。SiteCalc 不自带任何踢面或踏面数值——只有你自己填写的限值才是最新的。

# stair.stringerLength
source: Stringer length
ar: طول الجائز
de: Wangenlänge
es: Longitud de zanca
fr: Longueur du limon
it: Lunghezza del cosciale
pt_pt: Comprimento da perna
tr: Limon kirişi uzunluğu
zh_hans: 斜梁长度

# stair.totalRise
source: Total rise
ar: الارتفاع الكلي
de: Gesamthöhe
es: Altura total
fr: Hauteur totale
it: Altezza totale
pt_pt: Altura total
tr: Toplam yükseklik
zh_hans: 总升高

# stair.totalRun
source: Total run
ar: المسقط الكلي
de: Gesamtlauf
es: Desarrollo total
fr: Reculement total
it: Sviluppo totale
pt_pt: Desenvolvimento total
tr: Toplam gidiş
zh_hans: 总进深

# stair.treadCount
source: Tread count
ar: عدد الدرجات
de: Anzahl der Auftritte
es: Número de huellas
fr: Nombre de girons
it: Numero di pedate
pt_pt: Número de cobertores
tr: Basamak sayısı
zh_hans: 踏面数

# tab.calculator
source: Calculator
ar: الآلة الحاسبة
de: Rechner
es: Calculadora
fr: Calculatrice
it: Calcolatrice
pt_pt: Calculadora
tr: Hesap Makinesi
zh_hans: 计算器

# tab.jobs
source: Jobs
ar: المشاريع
de: Projekte
es: Proyectos
fr: Chantiers
it: Cantieri
pt_pt: Projetos
tr: İşler
zh_hans: 项目

# tab.settings
source: Settings
ar: الإعدادات
de: Einstellungen
es: Ajustes
fr: Réglages
it: Impostazioni
pt_pt: Definições
tr: Ayarlar
zh_hans: 设置

# tab.solvers
source: Solvers
ar: الأدوات
de: Löser
es: Herramientas
fr: Outils
it: Strumenti
pt_pt: Ferramentas
tr: Araçlar
zh_hans: 求解器

# tape.error.incompatible
source: These values can't be combined
ar: لا يمكن دمج هذه القيم
de: Diese Werte lassen sich nicht kombinieren
es: Estos valores no se pueden combinar
fr: Ces valeurs ne peuvent pas être combinées
it: Questi valori non possono essere combinati
pt_pt: Estes valores não podem ser combinados
tr: Bu değerler birleştirilemez
zh_hans: 这些数值无法组合

# tape.unlabeled
source: Unlabeled
ar: بلا تسمية
de: Ohne Beschriftung
es: Sin etiqueta
fr: Sans étiquette
it: Senza etichetta
pt_pt: Sem etiqueta
tr: Etiketsiz
zh_hans: 无标签

# common.done
source: Done
ar: تم
de: Fertig
es: Listo
fr: OK
it: Fine
pt_pt: Concluído
tr: Bitti
zh_hans: 完成
